historic/moonshot-samples/C9N1/results/mixed-506-32to64k_160Mseq.fio.out
randread-32k-64k: (g=0): rw=randread, bs=32K-64K/32K-64K/32K-64K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-32k-64k: (groupid=0, jobs=1): err= 0: pid=32758: Fri May 27 18:14:53 2016
  read : io=55077MB, bw=939967KB/s, iops=21749, runt= 60001msec
    slat (usec): min=3, max=13946, avg=13.07, stdev=33.31
    clat (usec): min=1, max=156345, avg=445.03, stdev=1598.76
     lat (usec): min=89, max=156367, avg=458.22, stdev=1600.90
    clat percentiles (usec):
     |  1.00th=[  149],  5.00th=[  175], 10.00th=[  195], 20.00th=[  223],
     | 30.00th=[  249], 40.00th=[  278], 50.00th=[  310], 60.00th=[  358],
     | 70.00th=[  422], 80.00th=[  516], 90.00th=[  732], 95.00th=[  932],
     | 99.00th=[ 1576], 99.50th=[ 1848], 99.90th=[11840], 99.95th=[18560],
     | 99.99th=[86528]
    bw (KB  /s): min= 4970, max=1180160, per=85.45%, avg=943211.70, stdev=279848.81
    lat (usec) : 2=0.01%, 4=0.01%, 20=0.01%, 50=0.01%, 100=0.03%
    lat (usec) : 250=30.51%, 500=47.95%, 750=12.21%, 1000=5.13%
    lat (msec) : 2=3.78%, 4=0.22%, 10=0.06%, 20=0.08%, 50=0.01%
    lat (msec) : 100=0.02%, 250=0.01%
  cpu          : usr=5.55%, sys=33.32%, ctx=657267, majf=0, minf=171
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1304994/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=32759: Fri May 27 18:14:53 2016
  read : io=9604.0MB, bw=163895KB/s, iops=160, runt= 60005msec
    slat (usec): min=63, max=11059, avg=292.38, stdev=152.53
    clat (usec): min=219, max=166724, avg=5445.40, stdev=17657.78
     lat (usec): min=672, max=166878, avg=5738.54, stdev=17669.59
    clat percentiles (usec):
     |  1.00th=[  604],  5.00th=[  644], 10.00th=[  668], 20.00th=[  700],
     | 30.00th=[  732], 40.00th=[  780], 50.00th=[  852], 60.00th=[  988],
     | 70.00th=[ 1208], 80.00th=[ 1704], 90.00th=[ 7776], 95.00th=[20352],
     | 99.00th=[102912], 99.50th=[113152], 99.90th=[144384], 99.95th=[156672],
     | 99.99th=[166912]
    bw (KB  /s): min=95302, max=419371, per=14.88%, avg=164194.20, stdev=25946.16
    lat (usec) : 250=0.01%, 500=0.14%, 750=33.70%, 1000=26.69%
    lat (msec) : 2=22.23%, 4=5.87%, 10=2.02%, 20=4.21%, 50=1.41%
    lat (msec) : 100=2.61%, 250=1.11%
  cpu          : usr=0.27%, sys=5.18%, ctx=18112, majf=0, minf=526
  IO depths    : 1=86.6%, 2=1.4%, 4=2.7%, 8=9.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=9604/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=32760: Fri May 27 18:14:53 2016
  write: io=9602.0MB, bw=163893KB/s, iops=160, runt= 59993msec
    slat (usec): min=86, max=11992, avg=328.93, stdev=165.77
    clat (usec): min=54, max=166759, avg=5868.05, stdev=17918.02
     lat (usec): min=761, max=167155, avg=6197.78, stdev=17931.54
    clat percentiles (usec):
     |  1.00th=[  852],  5.00th=[  924], 10.00th=[  988], 20.00th=[ 1048],
     | 30.00th=[ 1096], 40.00th=[ 1144], 50.00th=[ 1176], 60.00th=[ 1224],
     | 70.00th=[ 1304], 80.00th=[ 1576], 90.00th=[ 9152], 95.00th=[20608],
     | 99.00th=[104960], 99.50th=[112128], 99.90th=[142336], 99.95th=[154624],
     | 99.99th=[166912]
    bw (KB  /s): min=93263, max=468055, per=100.00%, avg=164115.50, stdev=30499.48
    lat (usec) : 100=0.01%, 500=0.05%, 750=0.06%, 1000=11.54%
    lat (msec) : 2=71.75%, 4=3.36%, 10=3.66%, 20=4.44%, 50=1.28%
    lat (msec) : 100=2.67%, 250=1.19%
  cpu          : usr=0.98%, sys=5.07%, ctx=18236, majf=0, minf=9
  IO depths    : 1=86.7%, 2=1.2%, 4=2.4%, 8=9.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=9602/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=64681MB, aggrb=1077.1MB/s, minb=163894KB/s, maxb=939967KB/s, mint=60001msec, maxt=60005msec
  WRITE: io=9602.0MB, aggrb=163893KB/s, minb=163893KB/s, maxb=163893KB/s, mint=59993msec, maxt=59993msec

Disk stats (read/write):
  nvme0n1: ios=1389947/86373, merge=0/0, ticks=992932/447412, in_queue=1441252, util=99.92%